In [3]:
print('start')

start

<u>**Dropna/fillna**</u>

In [32]:
import numpy as np
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', '', 'David', 'Eve'],
    'Age': [25, 30, np.nan, 22, 28],
    'City': ['New York', 'Los Angeles', np.nan, 'Chicago', 'Houston'],
    'Score': [85.5, np.nan, 90.0, 76.5, 'N/A'],
}

df=pd.DataFrame(data)
df

    Name   Age         City Score
0  Alice  25.0     New York  85.5
1    Bob  30.0  Los Angeles   NaN
2          NaN          NaN  90.0
3  David  22.0      Chicago  76.5
4    Eve  28.0      Houston   N/A

In [33]:
# In our datasets there are indeed a missing value categorized by NAN . Our task is to drop/delete those NA
beta=df.dropna(axis=0,how='all')#This is a way to remove NAN value from the datasets,
beta

    Name   Age         City Score
0  Alice  25.0     New York  85.5
1    Bob  30.0  Los Angeles   NaN
2          NaN          NaN  90.0
3  David  22.0      Chicago  76.5
4    Eve  28.0      Houston   N/A

In [36]:
#Removing specific column data subset() concept

peta=df.dropna(subset=['Age']) #Column 2 has been vanished because we drop it
peta

    Name   Age         City Score
0  Alice  25.0     New York  85.5
1    Bob  30.0  Los Angeles   NaN
3  David  22.0      Chicago  76.5
4    Eve  28.0      Houston   N/A

In [37]:
df.dropna(thresh=4) # Drop rows that do not have at least 4 non-NA values

    Name   Age      City Score
0  Alice  25.0  New York  85.5
3  David  22.0   Chicago  76.5
4    Eve  28.0   Houston   N/A

In [39]:
# Fllna is opposite of dropna. Fillna basically fills the value as userdefined
df.fillna("error")

    Name    Age         City  Score
0  Alice   25.0     New York   85.5
1    Bob   30.0  Los Angeles  error
2         error        error   90.0
3  David   22.0      Chicago   76.5
4    Eve   28.0      Houston    N/A

In [44]:
#filling the value by column: being specific
df.fillna({'Age':'Age Not Defined',"City":'Not Available'})

    Name              Age           City Score
0  Alice             25.0       New York  85.5
1    Bob             30.0    Los Angeles   NaN
2         Age Not Defined  Not Available  90.0
3  David             22.0        Chicago  76.5
4    Eve             28.0        Houston   N/A

In [55]:
#You can fill the value as it is in the after and before : View the index 2 : to see changes

forward = df.ffill()
print(forward)
print('-'*50)
backward = df.bfill()
print(backward)

    Name   Age         City Score
0  Alice  25.0     New York  85.5
1    Bob  30.0  Los Angeles  85.5
2         30.0  Los Angeles  90.0
3  David  22.0      Chicago  76.5
4    Eve  28.0      Houston   N/A
--------------------------------------------------
    Name   Age         City Score
0  Alice  25.0     New York  85.5
1    Bob  30.0  Los Angeles  90.0
2         22.0      Chicago  90.0
3  David  22.0      Chicago  76.5
4    Eve  28.0      Houston   N/A